app/controllers/api/logs_controller.rb

INSERT INTO "logs" ("application", "created_at", "extras", "parameters", "time", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  	def create
      # If the request body contains a single log (request body is not an array)
      if ( !JSON.parse(request.body.read).is_a?(Array) )
        log_data = JSON.parse(request.body.read)
        status, log = create_new_log(log_data)
        if (status)
          render json: log, status: :created
        else
          render json: log.errors, status: :unprocessable_entity
        end
      # If the request body contains multiple logs (request body is an array)
      else
        logs = []
        # Loop through all logs. Each array element is considered a single log
        JSON.parse(request.body.read).each do |log_data|
          status, log = create_new_log(log_data)
          if (!status)
            render render json: log.errors, status: :unprocessable_entity
          else
            logs.push(log)