app/controllers/data_queries_controller.rb

SELECT "data_queries".* FROM "data_queries"  WHERE "data_queries"."user_id" = $1  [["user_id", 1]]
---
    def set_data_query
      @data_query = current_user.data_queries.find(params[:id])