app/controllers/documents_controller.rb

INSERT INTO "documents" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-22 09:33:47.323615"], ["name", "MyString"], ["updated_at", "2014-08-22 09:33:47.323615"]]
---
  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save

DELETE FROM "documents" WHERE "documents"."id" = $1  [["id", 177]]
---
  def destroy
    @document.destroy

SELECT  "documents".* FROM "documents"  WHERE "documents"."id" = $1 LIMIT 1  [["id", 182]]
---
    def set_document
      @document = Document.find(params[:id])