app/controllers/logs_controller.rb

  def index
    @application_list = Log.uniq.pluck(:application)
    @activity_list = Log.uniq.pluck(:activity)
---
SELECT DISTINCT "logs"."application" FROM "logs"  WHERE "logs"."application" IN ('Geniverse', 'IS', 'Unknown', 'TestApplication', 'Unknown: http://www.epochconverter.com/', 'Business')
SELECT DISTINCT "logs"."activity" FROM "logs"  WHERE "logs"."application" IN ('Geniverse', 'IS', 'Unknown', 'TestApplication', 'Unknown: http://www.epochconverter.com/', 'Business')