app/controllers/pages_controller.rb

  def explore
    @application_list = Log.uniq.pluck(:application)
    @activity_list = Log.uniq.pluck(:activity)
---
SELECT DISTINCT "logs"."application" FROM "logs"  WHERE "logs"."application" IN ('Geniverse', 'IS', 'Unknown', 'TestApplication', 'Unknown: http://www.epochconverter.com/', 'Business')
SELECT DISTINCT "logs"."activity" FROM "logs"  WHERE "logs"."application" IN ('Geniverse', 'IS', 'Unknown', 'TestApplication', 'Unknown: http://www.epochconverter.com/', 'Business')

  def get_explore_data
    application = params[:explore][:application]
    activity = params[:explore][:activity]
    logs = Log.all
    logs = logs.where(application: application) if application.present?
    logs = logs.where(activity: activity) if activity.present?
    @events = logs.uniq.pluck(:event)
---
SELECT "logs".* FROM "logs"  WHERE "logs"."application" IN ('Geniverse', 'IS', 'Unknown', 'TestApplication', 'Unknown: http://www.epochconverter.com/', 'Business') AND "logs"."application" = 'Business'
SELECT DISTINCT "logs"."event" FROM "logs"  WHERE "logs"."application" IN ('Geniverse', 'IS', 'Unknown', 'TestApplication', 'Unknown: http://www.epochconverter.com/', 'Business') AND "logs"."application" = 'Business'